In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.2.3'

In [3]:
#API에 대한 확인
#help(pd.read_csv)
#help(pd.DataFrame)
#help(pd)

In [4]:
## Series
# -1차원 데이터 구조
# -Series는 **pd.Series()**로 생성

In [5]:
s = pd.Series([3,-5,7,4]) #인덱스 없이 생성

In [6]:
s

0    3
1   -5
2    7
3    4
dtype: int64

인덱스를 특별히 지정해주지 않으면 Numpy 다차원배열처럼 0부터 인덱스가 시작된다.
### pandas Series는 인덱스를 지정해줄 수 있고, 숫자가 아닌 문자열도 인덱스가 될 수 있다.

In [7]:
data=[3,-5,7,4,7,3]
s = pd.Series(data, index=['a','b','c','d','e','f'])
s

a    3
b   -5
c    7
d    4
e    7
f    3
dtype: int64

In [8]:
type(s)

pandas.core.series.Series

In [9]:
s.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [10]:
s.values

array([ 3, -5,  7,  4,  7,  3])

In [11]:
s.dtype

dtype('int64')

In [12]:
s.shape

(6,)

`shape`는 (행, 열의 개수)을 나타낸다.

In [13]:
s.ndim

1

`ndim`은 차원을 나타낸다. 1차원이므로 1이 출력된다.

In [14]:
s.value_counts()

 3    2
 7    2
 4    1
-5    1
dtype: int64

s에 나오는 데이터 값이 나오는 횟수를 알 수 있다. 3은 2번, 7도 2버느 4와 -5는 각 1번씩이다.

Series에서의 `value_counts`

In [16]:
# index 명으로 조회
s['a']

3

In [17]:
# index 순서로 조회
s[0]

3

In [18]:
# pop_dict는 파이썬 딕셔너리
pop_dict = {'Germany': 81,
           'Korea': 99,
           'France': 74,
           'UK': 68,
           'Brazil': 22}

#pop_dict로 Series 생성
population = pd.Series(pop_dict)
population

Germany    81
Korea      99
France     74
UK         68
Brazil     22
dtype: int64

### 딕셔너리에서 key값을 이용해 value를 조회하듯 Series에서 index를 이용해 value를 조회할 수 있다.

In [19]:
pop_dict['Korea'] #딕셔너리

99

In [20]:
population['UK']  #Series

68

#### 딕셔너리와 Series의 차이점은 딕셔너리의 key는 순서가 없고 Pandas Series의 index에는 순서가 있다는 점이다. 그래서 Series의 index는 순서를 통해서 value 조회가 가능하다.

In [21]:
# 딕셔너리에서는 key값으로만 value를 반환할 수 있다. 
pop_dict[2] #pop_dict는 딕셔너리

#keyError가 뜨는 이유는 딕셔너리는 순서가 없어서 인덱싱을 할 수 없기 때문이다. 그래서 딕셔너리에는 key값을 명확히 해야하는데 2라는 값을 넣어서
#오류가 뜬다.

KeyError: 2

In [22]:
population[2] #Pandas Series

#Series는 인덱싱을 할 수 있다. 그래서 [] 사이에 인덱싱 번호를 쓰면 그에 맞는 value값을 반환한다.
#인덱싱 번호는 0부터 시작한다.

74

In [23]:
population[:3]

Germany    81
Korea      99
France     74
dtype: int64

In [24]:
population[:]

Germany    81
Korea      99
France     74
UK         68
Brazil     22
dtype: int64

In [25]:
population[-1]

22

In [26]:
population.index

Index(['Germany', 'Korea', 'France', 'UK', 'Brazil'], dtype='object')

In [27]:
population.values

array([81, 99, 74, 68, 22])

In [28]:
population.dtype

dtype('int64')

#### Series는 딕셔너리와 다르게 아래와 같은 연산이 가능하다.

In [29]:
population*100 # 각 value에 100을 곱한 값을 반환

Germany    8100
Korea      9900
France     7400
UK         6800
Brazil     2200
dtype: int64

In [30]:
population-10 #각 value에 10을 뺀 값을 반환

Germany    71
Korea      89
France     64
UK         58
Brazil     12
dtype: int64

In [31]:
#딕셔너리에 연산을 하면 TypeError 발생
pop_dict *100

TypeError: unsupported operand type(s) for *: 'dict' and 'int'

### DataFrame
- 2차원 데이터 구조
- 일반적으로 df로 이름 붙임
- 엑셀 스프레드시트, 데이터베이스 등과 동일한 <U>2차원 구조<U/>

#### DataFrame은 <U>pd.DataFrame()<U>으로 생성한다.

#### 중첩된 리스트를 통한 데이터 생성
각 행을 리스트로 만들어야 한다.

In [125]:
data = [['Freance','Paris', 1234777],
       ['India', 'New Delhi', 1305457654],
       ['Brazil', 'Brasilia', 207845485]]

df = pd.DataFrame(data)

df

#df[0]

# df[1]

# df[2]

0    Freance
1      India
2     Brazil
Name: 0, dtype: object

*columns 파라메타를 통해 칼럼명을 정해줄 수 있다.*

In [33]:
data = [['Freance','Paris', 1234777],
       ['India', 'New Delhi', 1305457654],
       ['Brazil', 'Brasilia', 207845485]]

df = pd.DataFrame(data, columns = ['Country', 'Capital', 'Population'])

df

   Country    Capital  Population
0  Freance      Paris     1234777
1    India  New Delhi  1305457654
2   Brazil   Brasilia   207845485

In [34]:
df['Country']

0    Freance
1      India
2     Brazil
Name: Country, dtype: object

In [35]:
df['Capital']

0        Paris
1    New Delhi
2     Brasilia
Name: Capital, dtype: object

In [36]:
df.Country

0    Freance
1      India
2     Brazil
Name: Country, dtype: object

데이터 프레임의 데이터는 딕셔너리로 넘겨주는 것이 일반적이다.
- 컬럼명을 함께 넘겨줄 수 있기 때문이다.
- 동일한 데이터 타입끼리 함께 묶어서 넘겨줄 수 있기 때문이다.

In [45]:
data = {'Country': ['France', 'India', 'Brazil'],
        'Capital': ['Paris', 'New Delhi','Brasilia'],
        'Population' : [1234000, 123523423523, 125523521]}

df = pd.DataFrame(data)

df

  Country    Capital    Population
0  France      Paris       1234000
1   India  New Delhi  123523423523
2  Brazil   Brasilia     125523521

컬럼명과 마찬가지로 인덱스 역시 변경할 수 있다.

In [44]:
df_2 = pd.DataFrame(data, index = ['aa','bb','cc'])

df_2

   Country    Capital    Population
aa  France      Paris       1234000
bb   India  New Delhi  123523423523
cc  Brazil   Brasilia     125523521

In [46]:
type(df_2)

pandas.core.frame.DataFrame

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [49]:
type(df.Country) # = type(df['Country'])

pandas.core.series.Series

In [50]:
df.Country

0    France
1     India
2    Brazil
Name: Country, dtype: object

In [51]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [52]:
df.columns

Index(['Country', 'Capital', 'Population'], dtype='object')

In [54]:
df.dtypes

Country       object
Capital       object
Population     int64
dtype: object

## DataFrame

In [55]:
s_df = pd.DataFrame([[1,2,3,4,7],[1,4,5,6,7],[4,2,8,10,12]], index =['a','b','c'], columns=['A','B','C','D','E'])
s_df

   A  B  C   D   E
a  1  2  3   4   7
b  1  4  5   6   7
c  4  2  8  10  12

DataFrame에서의 `value_counts`

In [56]:
s_df['A'].value_counts()

1    2
4    1
Name: A, dtype: int64

#### A 열에는 1이 2번 나오고, 4가 1번 나온다.

In [57]:
s_df['B'].value_counts()

2    2
4    1
Name: B, dtype: int64

#### B 열에는 2가 2번 나오고, 4가 1번 나온다.

In [58]:
s_df['C'].value_counts()

8    1
5    1
3    1
Name: C, dtype: int64

#### C 열에는 8이 1번, 5가 1번, 3이 1번 나온다.

-------------------

#### 인덱싱 : Series는 요소를 index명 또는 index의 순서를 통해 인덱싱할 수 있다.
#### index명으로 조회 가능

------------
### 특정한 칼럼을 index로 사용할수도 있다.

In [62]:
df

  Country    Capital    Population
0  France      Paris       1234000
1   India  New Delhi  123523423523
2  Brazil   Brasilia     125523521

In [112]:
df_index_with_country = df.set_index('Country')

df_index_with_country    #set_index 메서드

           Capital    Population
Country
France       Paris       1234000
India    New Delhi  123523423523
Brazil    Brasilia     125523521

하나의 인덱스만 가능한 것이 아니다. DataFrame은 여러개의 인덱스를 가질 수 있다.

In [64]:
df_index_with_country_and_capital = df.set_index(['Country','Capital'])

df_index_with_country_and_capital

                     Population
Country Capital
France  Paris           1234000
India   New Delhi  123523423523
Brazil  Brasilia      125523521

In [66]:
# 인덱싱
df_index_with_country_and_capital.loc[['France','India']]

                     Population
Country Capital
France  Paris           1234000
India   New Delhi  123523423523

`loc[]` : 인덱스 기준으로 행데이터 읽기

`iloc[]` : 행번호를 기준으로 행데이터 읽기

-------------------
### Dataframe의 column은 어떤 데이터타입일까

기존에 학습한 데이터프레임 생성 방식은 아래처럼 모든 데이터를 직접 명시해주는 것이었습니다.

아래 코드는 각 열을 파이썬의 리스트 형태로 입력하는 방식입니다.
리스트 형태로 입력된 데이터를 기반으로 판다스가 Series를 만들고 Series들로 DataFrame을 만드는 것이죠.

In [67]:
data = {'col1': [1, 2, 3, 4],
        'col2': [5, 6, 7, 8],
        'col3': [9, 10, 11, 12]}

df_3 = pd.DataFrame(data, 
                    index=['A', 'B', 'C', 'D'])

df_3

   col1  col2  col3
A     1     5     9
B     2     6    10
C     3     7    11
D     4     8    12

In [69]:
s_1 = pd.Series([1, 2, 3, 4], index=['A', 'B', 'C', 'D'])
s_2 = pd.Series([5, 6, 7, 8], index=['A', 'B', 'C', 'D'])
s_3 = pd.Series([9, 10, 11, 12], index=['A', 'B', 'C', 'D'])

In [70]:
s_1

A    1
B    2
C    3
D    4
dtype: int64

In [71]:
s_2

A    5
B    6
C    7
D    8
dtype: int64

In [72]:
s_3

A     9
B    10
C    11
D    12
dtype: int64

In [73]:
data={'col1':s_1,
     'col2': s_2,
     'col3': s_3}

df_4 = pd.DataFrame(data, index=['A','B','C','D'])

df_4

   col1  col2  col3
A     1     5     9
B     2     6    10
C     3     7    11
D     4     8    12

------------------
# Numpy ndarray와 비교
### 공통점 : NumPy 다차원배열처럼 많은 연산들이 요소들간에 이뤄진다.

In [74]:
s

a    3
b   -5
c    7
d    4
e    7
f    3
dtype: int64

In [76]:
type(s)

pandas.core.series.Series

In [75]:
s+100  # 각 행에 100씩을 더한다. Series와 DataFrame는 연산이 가능하다.

a    103
b     95
c    107
d    104
e    107
f    103
dtype: int64

In [77]:
df

  Country    Capital    Population
0  France      Paris       1234000
1   India  New Delhi  123523423523
2  Brazil   Brasilia     125523521

In [78]:
df['Country'] + df['Capital']

0       FranceParis
1    IndiaNew Delhi
2    BrazilBrasilia
dtype: object

------------------
### 차이점

Series간 연산을 하는 경우, index를 기반으로 이루어진다.
(모든 Numpy 다차원배열은 shape가 동일하다면 index도 동일하기에 index가 달라 연산이 이루어지지 않는 경우는 없음)

In [79]:
s

a    3
b   -5
c    7
d    4
e    7
f    3
dtype: int64

In [81]:
s1=s[['a','b']]
s2=s[['b','c']]

In [82]:
s1

a    3
b   -5
dtype: int64

In [83]:
s2

b   -5
c    7
dtype: int64

In [85]:
s1 + s2

a     NaN
b   -10.0
c     NaN
dtype: float64

결과값이 NaN이 나오는 이유는?? 표현 불가능한 수치형 데이터

--------------------
# 실습

<div class="alert alert-success">
    <b>EXERCISE</b>: df_index_with_country이 데이터로 주어졌을때 각 국가의 수도 인구는 프랑스 수도 인구 대비 몇 배인지 구하세요.
</div>

In [113]:
df_index_with_country

           Capital    Population
Country
France       Paris       1234000
India    New Delhi  123523423523
Brazil    Brasilia     125523521

In [114]:
df_index_with_country['Population']/df_index_with_country['Population'][0]

Country
France         1.000000
India     100100.019062
Brazil       101.720844
Name: Population, dtype: float64

In [ ]:
df_index_with_country

# 3. Pandas Importing/ Exporting

실무에서는 이미 데이터가 존재하는 경우가 많고, 그 데이터를 판다스로 importing해서 분석을 진행한다.
CSV나 엑셀 형태의 파일로 저장된 데이터를 판다스로 가져오거나 직접 데이터베이스에 연결해서 데이터를 가져와서 작업하는 경우가 일반적이다.

pandas가 지원하는 Importing/Exporting 포맷은 아래와 같습니다.
- csv (모든 text파일 연결에 사용)
- excel
- sql (모든 데이터베이스 연결에 사용)
- hdf5
- json
- html
- pickle
- ...

### Importing 함수의 경우 **pd.read** 형태를 가진다.
### Exporting 함수의 경우 **df.to** 형태를 가진다.

In [124]:
json_data = df.to_json()
json_data


# JSON(제이슨[1], JavaScript Object Notation)은 
# 속성-값 쌍( attribute–value pairs and array data types 
# (or any other serializable value)) 또는 "키-값 쌍"으로 이루어진 
# 데이터 오브젝트를 전달하기 위해 인간이 읽을 수 있는 텍스트를 사용하는 개방형 표준 포맷이다.

'\nJSON(제이슨[1], JavaScript Object Notation)은 \n속성-값 쌍( attribute–value pairs and array data types \n(or any other serializable value)) 또는 "키-값 쌍"으로 이루어진 \n데이터 오브젝트를 전달하기 위해 인간이 읽을 수 있는 텍스트를 사용하는 개방형 표준 포맷이다.'

In [117]:
pd.read_json(json_data)

  Country    Capital    Population
0  France      Paris       1234000
1   India  New Delhi  123523423523
2  Brazil   Brasilia     125523521

In [118]:
# 파일다운로드 받기
#!wget -O 'iris_sample.csv' https://raw.githubusercontent.com/duc-ke/edu_jupyter_pandas/master/dataset/iris_sample.csv

In [119]:
import pandas as pd

In [120]:
url = 'https://raw.githubusercontent.com/duc-ke/edu_jupyter_pandas/master/dataset/iris_sample.csv'

In [121]:
df_iris_sample = pd.read_csv(url) # read_포맷종류

In [122]:
df_iris_sample

    sepal_length  sepal_width  petal_length  petal_width    species
0            5.1          3.5           1.4          0.2     setosa
1            4.9          3.0           1.4          0.2     setosa
2            4.7          3.2           1.3          0.2     setosa
3            4.6          3.1           1.5          0.2     setosa
4            5.0          3.6           1.4          0.2     setosa
5            5.4          3.9           1.7          0.4     setosa
6            4.6          3.4           1.4          0.3     setosa
7            5.0          3.4           1.5          0.2     setosa
8            4.4          2.9           1.4          0.2     setosa
9            4.9          3.1           1.5          0.1     setosa
10           5.4          3.7           1.5          0.2     setosa
11           4.8          3.4           1.6          0.2     setosa
12           4.8          3.0           NaN          0.1     setosa
13           4.3          3.0           1.1          0.1  virginica
14           5.8          4.0           NaN          0.2  virginica
15           5.7          NaN           1.5          0.4  virginica
16           5.4          3.9           1.3          0.4  virginica
17           5.1          3.5           NaN          0.3  virginica
18           5.7          3.8           1.7          0.3  virginica
19           5.1          3.8           1.5          0.3  virginica
20           5.1          3.5           1.4          0.2     setosa
21           4.9          3.0           1.4          0.2     setosa
22           4.7          3.2           1.3          0.2     setosa
23           5.1          3.5           1.4          0.2  virginica
24           4.9          3.0           1.4          0.2  virginica
25           4.7          3.2           1.3          0.2  virginica

In [ ]:
df_iris_sample